malpern/KeyPath/Scripts/lab/pico-hid-fixture/targets/waveshare-esp32-s3-touch-lcd-1.69/main/fixture_display.c
#include "fixture_display.h"

#include <inttypes.h>
#include <math.h>
#include <stdio.h>

#include "bsp/esp32_s3_touch_lcd_1_69.h"
#include "esp_timer.h"
#include "esp_wifi_types.h"
#include "fixture_board.h"
#include "fixture_config.h"
#include "fixture_runtime.h"
#include "fixture_splash_model.h"
#include "fixture_visual_model.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "lvgl.h"
#include "sdkconfig.h"

#define PARTICLE_COUNT 12u
#define KEY_COUNT 6u
#define DOJO_BAR_COUNT 4u
#define SPLASH_FRAME_INTERVAL_MS 33u
#define DISPLAY_HEARTBEAT_MAX_AGE_MS 2000u

typedef struct {
    lv_obj_t *screen;
    lv_obj_t *halo_outer;
    lv_obj_t *halo_inner;
    lv_obj_t *orbit;
    lv_obj_t *progress;
    lv_obj_t *core;
    lv_obj_t *brand_keycap;
    lv_obj_t *brand_light;
    lv_obj_t *brand_fill;
    lv_obj_t *brand_lid;
    lv_obj_t *brand_glint_horizontal;
    lv_obj_t *brand_glint_vertical;
    lv_obj_t *icon_front;
    lv_obj_t *icon_back;
    lv_obj_t *bear_ear_left;
    lv_obj_t *bear_ear_right;
    lv_obj_t *bear_head;
    lv_obj_t *bear_muzzle;
    lv_obj_t *bear_eye_left;
    lv_obj_t *bear_eye_right;
    lv_obj_t *bear_nose;
    lv_obj_t *keys[KEY_COUNT];
    lv_obj_t *particles[PARTICLE_COUNT];
    lv_obj_t *eyebrow;
    lv_obj_t *state;
    lv_obj_t *detail;
    lv_obj_t *quality;
    lv_obj_t *sound;
    fixture_ui_scene_t previous_scene;
    fixture_result_t previous_result;
    int visual_stage;
    float phase;
    uint64_t previous_render_ms;
    uint64_t icon_transition_started_ms;
    uint64_t completion_started_ms;
    uint64_t button_feedback_started_ms;
    uint32_t button_feedback_sequence;
    fixture_button_event_t button_feedback_event;
    uint64_t sound_feedback_started_ms;
    bool sound_feedback_silent;
} display_ui_t;

typedef struct {
    lv_obj_t *root;
    lv_obj_t *glow;
    lv_obj_t *ring;
    lv_obj_t *logo;
    lv_obj_t *bars[DOJO_BAR_COUNT];
    lv_obj_t *wordmark;
    lv_obj_t *location;
    lv_obj_t *version;
} display_splash_t;

static display_ui_t ui;
static display_splash_t splash;
static portMUX_TYPE display_health_lock = portMUX_INITIALIZER_UNLOCKED;
static fixture_display_health_t display_health;

static void note_display_frame(uint64_t now_ms) {
    taskENTER_CRITICAL(&display_health_lock);
    display_health.frame_sequence++;
    display_health.last_frame_ms = now_ms;
    taskEXIT_CRITICAL(&display_health_lock);
}

static void note_display_initialized(bool splash_enabled, bool splash_complete) {
    taskENTER_CRITICAL(&display_health_lock);
    display_health.initialized = true;
    display_health.splash_enabled = splash_enabled;
    display_health.splash_complete = splash_complete;
    taskEXIT_CRITICAL(&display_health_lock);
}

static void note_splash_complete(void) {
    taskENTER_CRITICAL(&display_health_lock);
    display_health.splash_complete = true;
    taskEXIT_CRITICAL(&display_health_lock);
}

static const char *symbol_for(fixture_visual_icon_t icon) {
    switch (icon) {
        case FIXTURE_ICON_POWER: return LV_SYMBOL_POWER;
        case FIXTURE_ICON_WIFI: return LV_SYMBOL_WIFI;
        case FIXTURE_ICON_KEYBOARD: return LV_SYMBOL_KEYBOARD;
        case FIXTURE_ICON_DOWNLOAD: return LV_SYMBOL_DOWNLOAD;
        case FIXTURE_ICON_WARNING: return LV_SYMBOL_WARNING;
        case FIXTURE_ICON_PLAY: return LV_SYMBOL_PLAY;
        case FIXTURE_ICON_OK: return LV_SYMBOL_OK;
        case FIXTURE_ICON_STOP: return LV_SYMBOL_STOP;
        case FIXTURE_ICON_CLOSE: return LV_SYMBOL_CLOSE;
        case FIXTURE_ICON_REFRESH: return LV_SYMBOL_REFRESH;
        case FIXTURE_ICON_BELL: return LV_SYMBOL_BELL;
        case FIXTURE_ICON_EYE: return LV_SYMBOL_EYE_OPEN;
        case FIXTURE_ICON_SETTINGS: return LV_SYMBOL_SETTINGS;
        case FIXTURE_ICON_NEXT: return LV_SYMBOL_NEXT;
    }
    return LV_SYMBOL_WARNING;
}

static lv_obj_t *make_circle(lv_obj_t *parent, int size, lv_color_t color, lv_opa_t opacity) {
    lv_obj_t *object = lv_obj_create(parent);
    lv_obj_remove_style_all(object);
    lv_obj_set_size(object, size, size);
    lv_obj_set_style_radius(object, LV_RADIUS_CIRCLE, 0);
    lv_obj_set_style_bg_color(object, color, 0);
    lv_obj_set_style_bg_opa(object, opacity, 0);
    lv_obj_clear_flag(object, LV_OBJ_FLAG_CLICKABLE);
    return object;
}

static lv_obj_t *make_rect(lv_obj_t *parent, int x, int y, int width, int height,
                           lv_color_t color) {
    lv_obj_t *object = lv_obj_create(parent);
    lv_obj_remove_style_all(object);
    lv_obj_set_pos(object, x, y);
    lv_obj_set_size(object, width, height);
    lv_obj_set_style_radius(object, 2, 0);
    lv_obj_set_style_bg_color(object, color, 0);
    lv_obj_set_style_bg_opa(object, LV_OPA_COVER, 0);
    lv_obj_clear_flag(object, LV_OBJ_FLAG_CLICKABLE);
    return object;
}

static void set_hidden(lv_obj_t *object, bool hidden) {
    if (hidden) {
        lv_obj_add_flag(object, LV_OBJ_FLAG_HIDDEN);
    } else {
        lv_obj_clear_flag(object, LV_OBJ_FLAG_HIDDEN);
    }
}

static void touch_event(lv_event_t *event) {
    if (lv_event_get_code(event) != LV_EVENT_PRESSED) return;
    fixture_runtime_snapshot_t snapshot;
    fixture_runtime_snapshot(&snapshot);
    if (snapshot.ui.state == FIXTURE_ARMED) {
        char error[128];
        if (fixture_runtime_start_demo(error, sizeof(error))) {
            fixture_board_tone(980u, 70u);
            return;
        }
        lv_obj_set_style_bg_color(ui.screen, lv_color_hex(0x241323), 0);
        fixture_runtime_abort("touch abort");
        fixture_board_tone(220u, 90u);
    } else if (snapshot.ui.state == FIXTURE_RUNNING) {
        lv_obj_set_style_bg_color(ui.screen, lv_color_hex(0x241323), 0);
        fixture_runtime_abort("touch abort");
        fixture_board_tone(220u, 90u);
    } else {
        ui.sound_feedback_silent = fixture_board_toggle_silent();
        ui.sound_feedback_started_ms = (uint64_t)(esp_timer_get_time() / 1000);
        if (!ui.sound_feedback_silent) fixture_board_tone(1040u, 65u);
    }
}

static void build_ui(void) {
    ui.screen = lv_screen_active();
    lv_obj_remove_style_all(ui.screen);
    lv_obj_set_style_bg_color(ui.screen, lv_color_hex(0x071117), 0);
    lv_obj_set_style_bg_opa(ui.screen, LV_OPA_COVER, 0);
    lv_obj_add_flag(ui.screen, LV_OBJ_FLAG_CLICKABLE);
    lv_obj_add_event_cb(ui.screen, touch_event, LV_EVENT_PRESSED, NULL);

