malpern/KeyPath/Scripts/lab/pico-hid-fixture/targets/waveshare-esp32-s3-touch-lcd-1.69/main/fixture_display.c
    ui.eyebrow = lv_label_create(ui.screen);
    lv_label_set_text_static(ui.eyebrow, "KEYPATH  /  HID ORACLE");
    lv_obj_set_style_text_font(ui.eyebrow, &lv_font_montserrat_12, 0);
    lv_obj_set_style_text_color(ui.eyebrow, lv_color_hex(0x71909d), 0);
    lv_obj_set_style_text_letter_space(ui.eyebrow, 2, 0);
    lv_obj_align(ui.eyebrow, LV_ALIGN_TOP_MID, 0, 15);

    ui.halo_outer = make_circle(ui.screen, 154, lv_color_hex(0x173946), LV_OPA_20);
    lv_obj_align(ui.halo_outer, LV_ALIGN_CENTER, 0, -2);
    ui.halo_inner = make_circle(ui.screen, 124, lv_color_hex(0x153541), LV_OPA_30);
    lv_obj_align(ui.halo_inner, LV_ALIGN_CENTER, 0, -2);

    ui.orbit = lv_arc_create(ui.screen);
    lv_obj_set_size(ui.orbit, 142, 142);
    lv_obj_align(ui.orbit, LV_ALIGN_CENTER, 0, -2);
    lv_arc_set_bg_angles(ui.orbit, 0, 360);
    lv_arc_set_angles(ui.orbit, 20, 104);
    lv_obj_set_style_arc_width(ui.orbit, 2, LV_PART_MAIN);
    lv_obj_set_style_arc_color(ui.orbit, lv_color_hex(0x183943), LV_PART_MAIN);
    lv_obj_set_style_arc_width(ui.orbit, 4, LV_PART_INDICATOR);
    lv_obj_set_style_arc_rounded(ui.orbit, true, LV_PART_INDICATOR);
    lv_obj_set_style_bg_opa(ui.orbit, LV_OPA_TRANSP, LV_PART_KNOB);
    lv_obj_clear_flag(ui.orbit, LV_OBJ_FLAG_CLICKABLE);

    ui.progress = lv_arc_create(ui.screen);
    lv_obj_set_size(ui.progress, 112, 112);
    lv_obj_align(ui.progress, LV_ALIGN_CENTER, 0, -2);
    lv_arc_set_range(ui.progress, 0, 1000);
    lv_arc_set_bg_angles(ui.progress, 135, 45);
    lv_arc_set_value(ui.progress, 0);
    lv_obj_set_style_arc_width(ui.progress, 5, LV_PART_MAIN);
    lv_obj_set_style_arc_color(ui.progress, lv_color_hex(0x18343e), LV_PART_MAIN);
    lv_obj_set_style_arc_width(ui.progress, 5, LV_PART_INDICATOR);
    lv_obj_set_style_arc_rounded(ui.progress, true, LV_PART_INDICATOR);
    lv_obj_set_style_bg_opa(ui.progress, LV_OPA_TRANSP, LV_PART_KNOB);
    lv_obj_clear_flag(ui.progress, LV_OBJ_FLAG_CLICKABLE);

    ui.core = make_circle(ui.screen, 76, lv_color_hex(0x0d2028), LV_OPA_COVER);
    lv_obj_set_style_border_width(ui.core, 1, 0);
    lv_obj_set_style_border_color(ui.core, lv_color_hex(0x2f6970), 0);
    lv_obj_align(ui.core, LV_ALIGN_CENTER, 0, -2);

    ui.icon_back = lv_label_create(ui.screen);
    lv_label_set_text_static(ui.icon_back, LV_SYMBOL_POWER);
    lv_obj_set_style_text_font(ui.icon_back, &lv_font_montserrat_20, 0);
    lv_obj_set_style_text_opa(ui.icon_back, LV_OPA_TRANSP, 0);
    lv_obj_align(ui.icon_back, LV_ALIGN_CENTER, 0, -2);
    ui.icon_front = lv_label_create(ui.screen);
    lv_label_set_text_static(ui.icon_front, LV_SYMBOL_POWER);
    lv_obj_set_style_text_font(ui.icon_front, &lv_font_montserrat_20, 0);
    lv_obj_align(ui.icon_front, LV_ALIGN_CENTER, 0, -2);

    /* Display-native Bear identity for Typover's app-specific physical tests. */
    ui.bear_ear_left = make_circle(ui.screen, 27, lv_color_hex(0xe34c42), LV_OPA_COVER);
    lv_obj_align(ui.bear_ear_left, LV_ALIGN_CENTER, -27, -28);
    ui.bear_ear_right = make_circle(ui.screen, 27, lv_color_hex(0xe34c42), LV_OPA_COVER);
    lv_obj_align(ui.bear_ear_right, LV_ALIGN_CENTER, 27, -28);
    ui.bear_head = make_circle(ui.screen, 78, lv_color_hex(0xe34c42), LV_OPA_COVER);
    lv_obj_set_style_shadow_color(ui.bear_head, lv_color_hex(0xf18c49), 0);
    lv_obj_set_style_shadow_width(ui.bear_head, 18, 0);
    lv_obj_set_style_shadow_opa(ui.bear_head, LV_OPA_20, 0);
    lv_obj_align(ui.bear_head, LV_ALIGN_CENTER, 0, -2);

    ui.bear_muzzle = lv_obj_create(ui.screen);
    lv_obj_remove_style_all(ui.bear_muzzle);
    lv_obj_set_size(ui.bear_muzzle, 45, 29);
    lv_obj_set_style_radius(ui.bear_muzzle, LV_RADIUS_CIRCLE, 0);
    lv_obj_set_style_bg_color(ui.bear_muzzle, lv_color_hex(0xffeee0), 0);
    lv_obj_set_style_bg_opa(ui.bear_muzzle, LV_OPA_COVER, 0);
    lv_obj_align(ui.bear_muzzle, LV_ALIGN_CENTER, 0, 11);
    lv_obj_clear_flag(ui.bear_muzzle, LV_OBJ_FLAG_CLICKABLE);

    ui.bear_eye_left = make_circle(ui.screen, 6, lv_color_hex(0x421f20), LV_OPA_COVER);
    lv_obj_align(ui.bear_eye_left, LV_ALIGN_CENTER, -14, -10);
    ui.bear_eye_right = make_circle(ui.screen, 6, lv_color_hex(0x421f20), LV_OPA_COVER);
    lv_obj_align(ui.bear_eye_right, LV_ALIGN_CENTER, 14, -10);
    ui.bear_nose = make_circle(ui.screen, 10, lv_color_hex(0x421f20), LV_OPA_COVER);
    lv_obj_align(ui.bear_nose, LV_ALIGN_CENTER, 0, 6);

    set_hidden(ui.bear_ear_left, true);
    set_hidden(ui.bear_ear_right, true);
    set_hidden(ui.bear_head, true);
    set_hidden(ui.bear_muzzle, true);
    set_hidden(ui.bear_eye_left, true);
    set_hidden(ui.bear_eye_right, true);
    set_hidden(ui.bear_nose, true);

    for (size_t index = 0; index < KEY_COUNT; ++index) {
        ui.keys[index] = lv_obj_create(ui.core);
        lv_obj_remove_style_all(ui.keys[index]);
        lv_obj_set_size(ui.keys[index], 17, 14);
        lv_obj_set_style_radius(ui.keys[index], 4, 0);
        lv_obj_set_style_bg_color(ui.keys[index], lv_color_hex(0x56ddb3), 0);
        lv_obj_set_style_bg_opa(ui.keys[index], LV_OPA_30, 0);
        int column = (int)(index % 3u);
        int row = (int)(index / 3u);
        lv_obj_set_pos(ui.keys[index], 8 + column * 21, 17 + row * 19);
    }

    /* Display-native reconstruction of KeyPath's opened, illuminated keycap. */
    ui.brand_keycap = lv_obj_create(ui.screen);
    lv_obj_remove_style_all(ui.brand_keycap);
    lv_obj_set_size(ui.brand_keycap, 78, 62);
    lv_obj_set_style_radius(ui.brand_keycap, 17, 0);
    lv_obj_set_style_bg_color(ui.brand_keycap, lv_color_hex(0xd95b18), 0);
    lv_obj_set_style_bg_opa(ui.brand_keycap, LV_OPA_COVER, 0);
    lv_obj_set_style_shadow_color(ui.brand_keycap, lv_color_hex(0xf3a128), 0);
    lv_obj_set_style_shadow_width(ui.brand_keycap, 18, 0);
    lv_obj_set_style_shadow_opa(ui.brand_keycap, LV_OPA_20, 0);
    lv_obj_align(ui.brand_keycap, LV_ALIGN_CENTER, 0, 5);
    lv_obj_clear_flag(ui.brand_keycap, LV_OBJ_FLAG_CLICKABLE);

    ui.brand_light = lv_obj_create(ui.screen);
    lv_obj_remove_style_all(ui.brand_light);
    lv_obj_set_size(ui.brand_light, 54, 38);
    lv_obj_set_style_radius(ui.brand_light, 12, 0);
    lv_obj_set_style_bg_color(ui.brand_light, lv_color_hex(0xfff2c9), 0);
    lv_obj_set_style_bg_opa(ui.brand_light, LV_OPA_COVER, 0);
    lv_obj_align(ui.brand_light, LV_ALIGN_CENTER, 0, 2);
    lv_obj_clear_flag(ui.brand_light, LV_OBJ_FLAG_CLICKABLE);

    ui.brand_fill = lv_obj_create(ui.brand_light);
    lv_obj_remove_style_all(ui.brand_fill);
    lv_obj_set_size(ui.brand_fill, 54, 1);
    lv_obj_set_style_radius(ui.brand_fill, 10, 0);
    lv_obj_set_style_bg_color(ui.brand_fill, lv_color_hex(0xf3a128), 0);
    lv_obj_set_style_bg_opa(ui.brand_fill, LV_OPA_60, 0);
    lv_obj_align(ui.brand_fill, LV_ALIGN_BOTTOM_MID, 0, 0);
    lv_obj_clear_flag(ui.brand_fill, LV_OBJ_FLAG_CLICKABLE);

    ui.brand_lid = lv_obj_create(ui.screen);
    lv_obj_remove_style_all(ui.brand_lid);
    lv_obj_set_size(ui.brand_lid, 68, 27);
    lv_obj_set_style_radius(ui.brand_lid, 10, 0);
    lv_obj_set_style_bg_color(ui.brand_lid, lv_color_hex(0xf3a128), 0);
    lv_obj_set_style_bg_opa(ui.brand_lid, LV_OPA_COVER, 0);
    lv_obj_set_style_shadow_color(ui.brand_lid, lv_color_hex(0xffd36a), 0);
    lv_obj_set_style_shadow_width(ui.brand_lid, 12, 0);
    lv_obj_set_style_shadow_opa(ui.brand_lid, LV_OPA_20, 0);
    lv_obj_align(ui.brand_lid, LV_ALIGN_CENTER, 0, -29);
    lv_obj_clear_flag(ui.brand_lid, LV_OBJ_FLAG_CLICKABLE);

    ui.brand_glint_horizontal = make_rect(
        ui.screen, 0, 0, 12, 2, lv_color_hex(0xfff7df));
    ui.brand_glint_vertical = make_rect(
        ui.screen, 0, 0, 2, 12, lv_color_hex(0xfff7df));
    lv_obj_set_style_radius(ui.brand_glint_horizontal, LV_RADIUS_CIRCLE, 0);
    lv_obj_set_style_radius(ui.brand_glint_vertical, LV_RADIUS_CIRCLE, 0);

